<?php
// $a = -5;
// $b = 5;
// function ext() {
//     // $a = 10;
//     // $b = 10;
//     $f = fn() => $a + $b;
//     return $f();
// }
// $t = $a < 0 ? 'negative': 'positive';
// echo $t;
echo '<h1>Стрелочные функции</h1>', '<br>';
echo '<p>Задание №1</p>';
$r = 5;
$f = fn($r) => 2*3.14 * $r;
echo $f($r);
?>
<?php
echo '<p>Задание №2</p>';
$r = 7;
$t = fn($r) => 3.14*($r**2);
echo "Площадь круга равна: ", $t($r);
?>
<?php
echo '<p>Задание №3</p>';
$a = 4;
$b = 6;
$c = 9;
$p = ($a + $b + $c)/2;
$s = fn($a, $b, $c, $p) =>sqrt($p*($p-$a)*($p-$b)*($p-$c));
echo 'Площадь трегольника равно: ', $s($a, $b, $c, $p),'<br>';
?>
<?php

?>